src/main/resources/xml/trainingServer/updateActor.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:my="my-namespace">
   <soapenv:Header/>
   <soapenv:Body>
      <my:updateActorRequest>
         <my:actorId></my:actorId>
         <my:newFirstName></my:newFirstName>
         <my:newLastName></my:newLastName>
      </my:updateActorRequest>
   </soapenv:Body>
</soapenv:Envelope>
